import numpy as np

# 高级索引
x = np.array([[1,  2],  [3,  4],  [5,  6]])
y = x[[0, 1, 2], [0, 1, 0]]
print(y)

print('===========')
x = np.array([[0, 1, 2], [3, 4, 5], [6, 7, 8], [9, 10, 11]])
print('我们的数组是：')
print(x)
rows = np.array([[0, 0], [3, 3]])
cols = np.array([[0, 2], [0, 2]])
y = x[rows, cols]
print('这个数组的四个角元素是：')
print(y)

print(x[[[0, 0], [3, 3]], [[0, 2], [0, 2]]])  # 这个值和上面的相等
#  以上组成的是rows中的第一个列表中的第一个元素对应cols中的第一个列表中的第一个元素组成的下标

print('=============')
a = np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]])
b = a[1:3, 1:3]
c = a[1:3, [1, 2]]
d = a[..., 1:]
print(b)
print(c)
print(d)

print('------------------')
#  布尔索引
x = np.array([[0,  1,  2], [3,  4,  5], [6,  7,  8], [9,  10,  11]])
print('我们的数组是：')
print(x)
print('\n')
# 现在我们会打印出大于 5 的元素
print('大于 5 的元素是：')
print(x[x>5])

