# 初始时在序列中找到最小（大）元素，放到序列的起始位置作为已排序序列；
# 然后，再从剩余未排序元素中继续寻找最小（大）元素，放到已排序序列的末尾。
# 以此类推，直到所有元素均排序完毕。

lst = [7, 2, 3, 8, 11, 22, 5, 1]
for i in range(len(lst)):
    for j in range(i+1, len(lst)):
        if lst[i] > lst[j]:
            lst[i], lst[j] = lst[j], lst[i]
    print(lst)
    #
    # [1, 7, 3, 8, 11, 22, 5, 2]
    # [1, 2, 7, 8, 11, 22, 5, 3]
    # [1, 2, 3, 8, 11, 22, 7, 5]
    # [1, 2, 3, 5, 11, 22, 8, 7]
    # [1, 2, 3, 5, 7, 22, 11, 8]
    # [1, 2, 3, 5, 7, 8, 22, 11]
    # [1, 2, 3, 5, 7, 8, 11, 22]
    # [1, 2, 3, 5, 7, 8, 11, 22]
